[{"title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate", "preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."}, {"title": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'", "preview": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."}, {"title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance", "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan."}, {"title": "Celebrate Mars Reconnaissance Orbiter's Views From Above", "preview": "Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more."}, {"title": "NASA's Perseverance Rover Is Midway to Mars ", "preview": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."}, {"title": "NASA's Perseverance Rover Will Peer Beneath Mars' Surface ", "preview": "The agency's newest rover will use the first ground-penetrating radar instrument on the Martian surface to help search for signs of past microbial life."}, {"title": "NASA to Reveal Name of Its Next Mars Rover", "preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday."}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"title": "NASA's New Mars Rover Will Use X-Rays to Hunt Fossils", "preview": "PIXL, an instrument on the end of the Perseverance rover's arm, will search for chemical fingerprints left by ancient microbes."}, {"title": "NASA's Briefcase-Size MarCO Satellite Picks Up Honors", "preview": "The twin spacecraft, the first of their kind to fly into deep space, earn a Laureate from Aviation Week & Space Technology."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest", "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite."}, {"title": "NASA's InSight 'Hears' Peculiar Sounds on Mars", "preview": "Listen to the marsquakes and other, less-expected sounds that the Mars lander has been detecting."}, {"title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities", "preview": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."}, {"title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars", "preview": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."}]